0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../parameters"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $nut;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    lowerAirfoil
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    upperAirfoil
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    trailingEdge
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    BaseAndTop
    {
        type            empty;
    }
}