constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../parameters"

simulationType RAS;

RAS
{
    RASModel        kOmegaSSTLM;

    turbulence      on;

    printCoeffs     on;

    alphaK1         $alphaK1;
    alphaK2         $alphaK2;
    alphaOmega1     $alphaOmega1;
    alphaOmega2     $alphaOmega2;
    gamma1          $gamma1;
    gamma2          $gamma2;
    beta1           $beta1;
    beta2           $beta2;
    betaStar        $betaStar;
    a1              $a1;
    b1              $b1;
    c1              $c1;
    F3              $F3;
    decayControl    $decayControl;
    kInf            $kInf;
    omegaInf        $omegaInf;
    ca1             $ca1;
    ca2             $ca2;
    ce1             $ce1;
    ce2             $ce2;
    cThetat         $cThetat;
    sigmaThetat     $sigmaThetat;
}

// ************************************************************************* //
