system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       simpleFoam;

startFrom         startTime;

startTime         0;

stopAt            endTime;

endTime           5000;

deltaT            1;

maxDeltaT         1;

adjustTimeStep    no;

maxCo             1.0;

writeControl      timeStep;

writeInterval     5000;

purgeWrite        0;

writeFormat       ascii;

writePrecision    6;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable true;

functions
{
    #include "include/forceCoefficients"
    #include "include/forceCoefficientTrigger"
    #include "include/pressureCoefficient"
    #include "include/cuttingPlanes"
    #include "include/yPlus"
    #include "include/residuals"
}

// ************************************************************************* //
