system/include/cuttingPlanes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampling;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

symmetry
{
    type                  surfaces;
    libs                  (sampling);

    interpolationScheme   cellPoint;

    surfaceFormat         vtk;

    writeControl          writeTime;

    log                   no;

    surfaces
    {
        symmetry
        {
            type          cuttingPlane;
            planeType     pointAndNormal;
            pointAndNormalDict
            {
                point     (0 0 -0.5);
                normal    (0 0 1);
            }
            interpolate   true;
        }
    }

    fields
    (
        U
        p
        nut
        k
    );
}

// ************************************************************************* //
