system/include/pressureCoefficient
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      pressureCoefficient;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pressureCoefficient
{
    type            pressure;
    libs            (fieldFunctionObjects);

    writeControl    writeTime;
    mode            staticCoeff;
    result          cp;

    rho             rhoInf;
    rhoInf          1;
    pInf            0;
    UInf            (0.01 0 0);
}

// ************************************************************************* //
