system/include/residuals
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      residuals;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

residuals
{
    type            solverInfo;
    libs            (utilityFunctionObjects);
    fields          (".*");
}

// ************************************************************************* //
